read_verilog -formal counter.v
prep -top counter
write_aiger -zinit counter.aig