read_verilog ref.v impl.v
equiv_make ref impl equiv
prep -top equiv
equiv_simple
equiv_status