read_verilog design.v
prep -top top
opt
write_verilog opt.v